/*
 * @Descripttion:
 * @version:
 * @Author: 程
 * @Date: 2022-11-09 09:33:05
 * @LastEditors: 程垒 💻
 * @LastEditTime: 2024-04-08 10:56:46
 */
export default {
  home: {
    title: '岁寒，然后知松柏之后凋也!',
    tips: '欢迎访问本站',
    resume: '个人简历',
    plugin: '前端工具',
    encapsulation: '代码封装',
  },
  tool: {
    title: '前端工具 / 网站',
    directory: '前端框架 - 文档',
    directory1: '前端Web UI库 - PC',
    directory2: '前端Web UI库 - 移动',
    directory3: '前端可视化',
    directory4: '前端插件',
    directory5: '字体图标库',
    directory6: '前端-复习/面试题',
    directory7: '其他工具 - (部分网站访问需科学上网)',
    aiTitle: '人工智能 - (部分网站访问需科学上网)',
    website: '网站',
  },
  nav: {
    HOME: '主页',
    ABOUT: '关于',
    PROJECT: '项目',
    EDUCATION: '教育',
    WORK: '工作',
    ADVANTAGE: '优势',
    CONTACT: '联系',
  },
  resume: {
    name: '程垒',
    introduction: '失败总是贯穿人生始终',
    copyright: '© 版权所有 ©2022 保留所有权利  此网站由 程垒制作. 使用 Vue3 制作：vuejs.org',
    footer: '持续更新中...',
  },
  info: {
    name: '我是程垒',
    tips: '一个超爱喝可乐的web前端攻城狮',
    btn: '下一个',
  },
  about: {
    title: '关于我自己',
    tips: '大鹏展翅,扶摇能上九万里!',
    content: '我性格开朗，善于与人沟通，有很强的团队合作意识，能快速适应新的团队合作，抗压能力强； 工作上进取心强，喜欢不断学习新技术新知识； 擅长研究，对前端开发有浓厚的兴趣，重视用户体验，有明确的目标和计划； 平时看一些掘金的小册子，遇到问题在github上提问，喜欢研究新的前端技术；',
    tools: '工具专业性',
    name: '程垒',
    positions: '前端开发工程师',
  },
  work: {
    branch: '南京骄扬软件科技有限公司西安分公司',
    tips: '内容',
    content: `1、根据产品需求、UI 设计稿完成前端开发任务;`,
    content1: `2、根据接口文档，完成前后端的联调;`,
    content2: `3、完成测试、验收过程中的 bug 修复;`,
    content3: ` 4、主要使用微信小程序开发图书商城; 前端开发工程师 2019.05-2020.01;`,
    content4: `5、使用 vue 开发和维护后台管理系统对图书进行上架,下架,秒杀,修改价格等操作;`,
    tips1: '业绩',
    items: '开发公司自己的乐品会学图书商城小程序,和后台管理,开发活动页面,商品详情页,和后台的图书 curd ,和一些系统问题的维护;',
  },
  work1: {
    branch: '杭州林鲲科技有限公司',
    tips: '内容',
    content: `1、使用 HTML、CSS、Bootstrap 编写静态页面;`,
    content1: `2、利用 JavaScript 和 Jquery 实现页面的动态效果;`,
    content2: `3、使用原生微信小程序进行项目的编写;`,
    content3: ` 4、与设计团队、后端开发团队紧密配合及优化网站前端性能;`,
    content4: `5、配合后端工程师完成前后台数据的交互;`,
    content5: `6、使用 Vue2.x / Vue3.x 进行后台管理系统的开发;`,
    content6: `7、使用 Echarts + Vue 进行大数据可视化/大数据屏的开发。`,
    tips1: '业绩',
    items: '开发公司自身的平台迭代,和一些新接项目的开发,定制一些前端开发规则,并搭建前端框架;小程序端则是使用原生微信小程序 开发,新的小程序项目使用 uniapp+vue 3开发;还开发过公司新版门户网站和移动端自适应门户网站;',
  },
  project: {
    title: '智慧农贸SAAS管理平台',
    content: '该平台是专门做智慧农贸信息化平台,食品安全追溯平台,该平台集合了大数据屏,商户数据,商户菜品,交易订单数据,管理人员, 农贸市场监控的对接;目前该平台已经有近1000家农贸市场入驻;',
    title1: '农贸市场综合监管平台/监管小程序',
    content1: '该平台是配套农贸市场端平台和小程序端一起使用的,可以看到市区下的所有农贸市场当日交易,客流已经发布农贸市场整改任 务;可以控制单个或多个农贸市场人员的权限菜单和使用;商户可以使用该小程序进行物业缴费,会员卡开卡,微信支付充卡等功能;;',
    title2: '智慧市场小程序',
    content2: '该小程序是针对市场开发,可以让商户查看自己所属的摊位有哪些,经营范围有哪些,自己的商户评级,查看进货凭证,缴费,交易明 细,称具管理,菜品优惠,账单等功能,可以让市场查看商户的点评,商户的信息,商户屏的状态,日常巡检,商户考核发布公告等功能;',
    title3: '环强再生资源平台+用户端小程序',
    content3:
      '环强再生资源平台是针对垃圾回收开发的一款产品,主要功能是,用户使用环强再生小程序提交选择垃圾类型,时间和物品照片, 添加自己的信息地址和电话,提交上去后,后台管理人员使用环强再生资源平台对该提交的信息进行审核,和车辆选择以及下发给 司机,司机端 app 收到消息后去用户家中取垃圾后再进行差价返还; 平台同上;',
    title4: '萧山国有农贸市场智慧大数据驾驶舱(大数据屏)',
    content4:
      '萧山国有农贸市场智慧大数据是针对杭州市萧山区下的农贸市场进行一个整合和直观数据的查看,可以非常直观的看到萧山农 贸市场下的每个农贸市场的客流,市场的图片,每日市场销售的排行榜,日/月销售的占比,和每个市场今日菜价的波动,24小时统 计,交易年走势,市场的考核,和热销的商品有哪些,还有商品溯源的信息等..全部轮博展示在大屏上;;',
    title5: '衢州市农贸市场大数据(大数据屏)',
    content5: '针对衢州市下的所有农贸市场进行展示;定制化开发衢州市场农贸数据整合,展示了农贸市场个数,当日,当月,当年交易量,菜品列 表滚动展示,天气,星级商户展示,红黑榜等功能;;',
  },
  advantage: {
    title: '个人优势',
    content: '• 熟练使用 JavaScript 实现页面中的交互效果,响应式布局;',
    content1: '• 熟练使用 Vue2.x / Vue3 / Uniapp / Element / Vant ,了解 React 和 Angular 框架基本语法规范;',
    content2: '• 熟练使用 Vue2.x 全家桶并有实际的项目开发经验;',
    content3: '• 熟悉 TypeScrip 语法 Vite 基本配置,Svn /Git 管理工具,小程序开发,大屏 Echarts ,地图可视化;',
    content4: '• 熟练掌握 Ajax,axios 与模板引擎和后端进行数据交互、拦截、实现动态渲染与页面部分刷新;',
    content5: '• 了解 Tailwindcss, threejs, node.js, mongodb;',
    content6: '• 在日常生活中喜欢编写个人博客文章发布在 CSDN上, 个人原创文章160+篇,拥有1000+粉丝数,总阅读量达到20万+;',
  },
};
