/*
 * @Descripttion:
 * @version:
 * @Author: 程
 * @Date: 2023-07-04 10:07:54
 * @LastEditors: 程
 * @LastEditTime: 2023-07-04 10:33:44
 */
const vocabularyData = [
  '大丈夫宁可玉碎，不能瓦全。——《北齐书·元景安传》',
  '不操千曲而后晓声，观千剑而后识器。——刘勰',
  '生当作人杰，死亦为鬼雄。——《夏日绝句》',
  '见兔而顾犬，未为晚也；亡羊而补牢，未为迟也。——《战国策》',
  '路漫漫其修远兮，吾将上下而求索。——《离骚》',
  '工欲善其事，必先利其器。——孔子',
  '富贵不能淫，贫贱不能移，威武不能屈。——《孟子》',
  '夫尺有所短，寸有所长。——《卜居》',
  '发奋忘食，乐以忘优，不知老之将至。——论语',
  '大直若屈，大巧若拙，大辩若讷。——《老子》',
  '天行健，君子以自强不息。——《周易》',
  '天下兴亡，匹夫有责。——顾炎武',
  '天下兴亡，百姓皆苦。——《左传》',
  '春风得意马蹄疾，一日看尽长安花。——《登科后》',
  '人生自古谁无死，留取丹心照汗青。——文天祥',
  '长风破浪会有时，直挂云帆济沧海。——《行路难·其一》',
  '采得百花成蜜后，为谁辛苦为谁甜。——《蜂》',
  '三军可夺帅也，匹夫不可夺志也。——《论语·子罕》',
  '捐躯赴国难，视死忽如归。——《白马篇》',
  '会当凌绝顶，一览众山小。——杜甫',
  '不鸣则已，一鸣惊人。——《史记·滑稽列传》',
  '笔落惊风雨，诗成泣鬼神。——《寄李十二白二十韵》',
  '先天下之忧而忧，后天下之乐而乐。——《岳阳楼记》',
  '燕雀安知鸿鹄之志哉。——《陈涉世家》',
  '修身 齐家 治国 平天下。——大学',
  '志当存高远，何必问今朝。 —— 陆游',
  '努力不一定成功，但放弃一定失败。 —— 蒲松龄',
  '山重水复疑无路，柳暗花明又一村。 —— 杨慎',
  '知己知彼，百战不殆。 —— 孙子兵法',
  '千里之行始于足下。 —— 老子',
  '机会只给那些为它准备的人。 —— 伯纳德·肖尔',
  '人生在世，其实很简单，就是不断地追求自己的梦想。 —— 乔治·卢卡斯',
  '人生就像一杯茶，不会苦一辈子，但总会苦一阵子。 —— 佚名',
  '人生没有彩排，每天都是现场直播。 —— 佚名',
  '吾生也有涯，而知也无涯。 —— 庄子',
  '生活不止眼前的苟且，还有诗和远方。 —— 屈原',
  '谁言寸草心，报得三春晖。 —— 孟郊',
];
export default vocabularyData;
